Here is a plan for Zimbabwe Staging

Terraform will perform the following actions:

  # module.aws.aws_s3_bucket_ownership_controls.chat will be created
  + resource "aws_s3_bucket_ownership_controls" "chat" {
      + bucket = "tl-public-chat-zw-stg"
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.aws.aws_s3_bucket_ownership_controls.docs will be created
  + resource "aws_s3_bucket_ownership_controls" "docs" {
      + bucket = "tl-aselo-docs-zw-staging"
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.aws.aws_ssm_parameter.aws_region will be created
  + resource "aws_ssm_parameter" "aws_region" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - account SID by short helpline"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/aws/AC48d146ce2460184b8944cc7fdf8c5d25/region"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "/staging/aws/AC48d146ce2460184b8944cc7fdf8c5d25/region"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "Name"        = "/staging/aws/AC48d146ce2460184b8944cc7fdf8c5d25/region"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.flex.null_resource.service_configuration must be replaced
-/+ resource "null_resource" "service_configuration" {
      ~ id       = "8670886941881901945" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "configuration" = (sensitive value)
        }
    }

  # module.twilioChannel["facebook"].twilio_studio_flows_v2.channel_messaging_flow will be updated in-place
  ~ resource "twilio_studio_flows_v2" "channel_messaging_flow" {
      ~ definition     = jsonencode( # whitespace changes
            {
                description   = "Facebook Messaging Flow"
                flags         = {
                    allow_concurrent_calls = true
                }
                initial_state = "Trigger"
                states        = [
                    {
                        name        = "Trigger"
                        properties  = {
                            offset = {
                                x = -90
                                y = -90
                            }
                        }
                        transitions = [
                            {
                                event = "incomingMessage"
                                next  = "attributes"
                            },
                            {
                                event = "incomingCall"
                            },
                            {
                                event = "incomingConversationMessage"
                            },
                            {
                                event = "incomingRequest"
                            },
                            {
                                event = "incomingParent"
                            },
                        ]
                        type        = "trigger"
                    },
                    {
                        name        = "attributes"
                        properties  = {
                            attributes = <<-EOT
                                {
                                  "name": "{{trigger.message.ChannelAttributes.from}}",
                                  "channelType": "{{trigger.message.ChannelAttributes.channel_type}}",
                                  "channelSid": "{{trigger.message.ChannelSid}}",
                                  "twilioNumber": "{{trigger.message.ChannelAttributes.twilioNumber}}",
                                  "ignoreAgent": "",
                                  "language":"en-US",
                                  "transferTargetType": "",
                                  "memory": {{widgets.ChatBot.memory | to_json}}
                                }
                            EOT
                            channel    = "TCab0384ca345e91e804468b8e63e50261"
                            offset     = {
                                x = 100
                                y = 190
                            }
                            workflow   = "WWfd9eb357c72a412fb1853721f38c80b8"
                        }
                        transitions = [
                            {
                                event = "callComplete"
                                next  = "welcome_message"
                            },
                            {
                                event = "failedToEnqueue"
                            },
                            {
                                event = "callFailure"
                            },
                        ]
                        type        = "send-to-flex"
                    },
                    {
                        name        = "welcome_message"
                        properties  = {
                            body    = "Thank you for contacting Childline Zimbabwe, a counsellor will be with you shortly. If this is an emergency or you wait longer than 30 min, we recommend you call us for free at 116."
                            channel = "{{trigger.message.ChannelSid}}"
                            from    = "Bot"
                            offset  = {
                                x = 290
                                y = 500
                            }
                            service = "{{trigger.message.InstanceSid}}"
                            to      = "{{contact.channel.address}}"
                        }
                        transitions = [
                            {
                                event = "sent"
                            },
                            {
                                event = "failed"
                            },
                        ]
                        type        = "send-message"
                    },
                ]
            }
        )
        id             = "FWe6e3deeee287b349037aa6a69eeb0a5b"
        # (4 unchanged attributes hidden)
    }

  # module.twilioChannel["sms"].twilio_studio_flows_v2.channel_messaging_flow will be updated in-place
  ~ resource "twilio_studio_flows_v2" "channel_messaging_flow" {
      ~ definition    = jsonencode( # whitespace changes
            {
                description   = "Sms Messaging Flow"
                flags         = {
                    allow_concurrent_calls = true
                }
                initial_state = "Trigger"
                states        = [
                    {
                        name        = "Trigger"
                        properties  = {
                            offset = {
                                x = -90
                                y = -90
                            }
                        }
                        transitions = [
                            {
                                event = "incomingMessage"
                                next  = "attributes"
                            },
                            {
                                event = "incomingCall"
                            },
                            {
                                event = "incomingConversationMessage"
                            },
                            {
                                event = "incomingRequest"
                            },
                            {
                                event = "incomingParent"
                            },
                        ]
                        type        = "trigger"
                    },
                    {
                        name        = "attributes"
                        properties  = {
                            attributes = <<-EOT
                                {
                                  "name": "{{trigger.message.ChannelAttributes.from}}",
                                  "channelType": "{{trigger.message.ChannelAttributes.channel_type}}",
                                  "channelSid": "{{trigger.message.ChannelSid}}",
                                  "twilioNumber": "{{trigger.message.ChannelAttributes.twilioNumber}}",
                                  "ignoreAgent": "",
                                  "language":"en-US",
                                  "transferTargetType": "",
                                  "memory": {{widgets.ChatBot.memory | to_json}}
                                }
                            EOT
                            channel    = "TCab0384ca345e91e804468b8e63e50261"
                            offset     = {
                                x = 100
                                y = 190
                            }
                            workflow   = "WWfd9eb357c72a412fb1853721f38c80b8"
                        }
                        transitions = [
                            {
                                event = "callComplete"
                                next  = "welcome_message"
                            },
                            {
                                event = "failedToEnqueue"
                            },
                            {
                                event = "callFailure"
                            },
                        ]
                        type        = "send-to-flex"
                    },
                    {
                        name        = "welcome_message"
                        properties  = {
                            body    = "Thank you for contacting Childline Zimbabwe, a counsellor will be with you shortly. If this is an emergency or you wait longer than 30 min, we recommend you call us for free at 116."
                            channel = "{{trigger.message.ChannelSid}}"
                            from    = "Bot"
                            offset  = {
                                x = 290
                                y = 500
                            }
                            service = "{{trigger.message.InstanceSid}}"
                            to      = "{{contact.channel.address}}"
                        }
                        transitions = [
                            {
                                event = "sent"
                            },
                            {
                                event = "failed"
                            },
                        ]
                        type        = "send-message"
                    },
                ]
            }
        )
        id            = "FWa8124868b7d79177631862b63238402f"
        # (3 unchanged attributes hidden)
    }

  # module.twilioChannel["webchat"].twilio_studio_flows_v2.channel_messaging_flow will be updated in-place
  ~ resource "twilio_studio_flows_v2" "channel_messaging_flow" {
      ~ definition     = jsonencode( # whitespace changes
            {
                description   = "Webchat Messaging Flow"
                flags         = {
                    allow_concurrent_calls = true
                }
                initial_state = "Trigger"
                states        = [
                    {
                        name        = "Trigger"
                        properties  = {
                            offset = {
                                x = -90
                                y = -90
                            }
                        }
                        transitions = [
                            {
                                event = "incomingMessage"
                                next  = "attributes"
                            },
                            {
                                event = "incomingCall"
                            },
                            {
                                event = "incomingConversationMessage"
                            },
                            {
                                event = "incomingRequest"
                            },
                            {
                                event = "incomingParent"
                            },
                        ]
                        type        = "trigger"
                    },
                    {
                        name        = "attributes"
                        properties  = {
                            attributes = <<-EOT
                                {
                                  "ip": "{{trigger.message.ChannelAttributes.pre_engagement_data.ip}}",
                                  "firstName": "{{trigger.message.ChannelAttributes.from}}",
                                  "channelType": "{{trigger.message.ChannelAttributes.channel_type}}",
                                  "channelSid": "{{trigger.message.ChannelSid}}",
                                  "helpline": "{{trigger.message.ChannelAttributes.pre_engagement_data.helpline}}",
                                  "language":"en-US",
                                  "ignoreAgent": "",
                                  "transferTargetType": "",
                                  "preEngagementData": {{trigger.message.ChannelAttributes.pre_engagement_data | to_json}},
                                  "memory": {{widgets.ChatBot.memory | to_json}}
                                }
                            EOT
                            channel    = "TCab0384ca345e91e804468b8e63e50261"
                            offset     = {
                                x = 100
                                y = 190
                            }
                            workflow   = "WWfd9eb357c72a412fb1853721f38c80b8"
                        }
                        transitions = [
                            {
                                event = "callComplete"
                                next  = "welcome_message"
                            },
                            {
                                event = "failedToEnqueue"
                            },
                            {
                                event = "callFailure"
                            },
                        ]
                        type        = "send-to-flex"
                    },
                    {
                        name        = "welcome_message"
                        properties  = {
                            body    = "Thank you for contacting Childline Zimbabwe, a counsellor will be with you shortly. If this is an emergency or you wait longer than 30 min, we recommend you call us for free at 116."
                            channel = "{{trigger.message.ChannelSid}}"
                            from    = "Bot"
                            offset  = {
                                x = 290
                                y = 500
                            }
                            service = "{{trigger.message.InstanceSid}}"
                            to      = "{{contact.channel.address}}"
                        }
                        transitions = [
                            {
                                event = "sent"
                            },
                            {
                                event = "failed"
                            },
                        ]
                        type        = "send-message"
                    },
                ]
            }
        )
        id             = "FWdb541c5c06c0260072325015d927e093"
        # (4 unchanged attributes hidden)
    }

Plan: 4 to add, 3 to change, 1 to destroy.

